In [1]:
import pandas as p

In [4]:
p.DataFrame({'a':[1,2,3,4,5],'b':[6,7,8,9,0],'c':[10,11,12,13,14]})

   a  b   c
0  1  6  10
1  2  7  11
2  3  8  12
3  4  9  13
4  5  0  14

In [8]:
p.DataFrame({'a':[1,2,3,4,5],'b':[6,7,8,9,0],'c':[10,11,12,13,14]},index=[5000,5001,5002,5003,5004])

      a  b   c
5000  1  6  10
5001  2  7  11
5002  3  8  12
5003  4  9  13
5004  5  0  14

In [9]:
a=p.DataFrame({'a':[1,2,3,4,5],'b':[6,7,8,9,0],'c':[10,11,12,13,14]},index=[5000,5001,5002,5003,5004])

In [10]:
a

      a  b   c
5000  1  6  10
5001  2  7  11
5002  3  8  12
5003  4  9  13
5004  5  0  14

In [11]:
a.head(2)

      a  b   c
5000  1  6  10
5001  2  7  11

In [12]:
a.head()

      a  b   c
5000  1  6  10
5001  2  7  11
5002  3  8  12
5003  4  9  13
5004  5  0  14

In [13]:
a.tail(2)

      a  b   c
5003  4  9  13
5004  5  0  14

In [14]:
a.tail()

      a  b   c
5000  1  6  10
5001  2  7  11
5002  3  8  12
5003  4  9  13
5004  5  0  14

In [15]:
a.head(6)

      a  b   c
5000  1  6  10
5001  2  7  11
5002  3  8  12
5003  4  9  13
5004  5  0  14

In [16]:
a.head(0)

Empty DataFrame
Columns: [a, b, c]
Index: []

In [17]:
a.tail(6)

      a  b   c
5000  1  6  10
5001  2  7  11
5002  3  8  12
5003  4  9  13
5004  5  0  14

In [18]:
a.tail(0)

Empty DataFrame
Columns: [a, b, c]
Index: []

In [19]:
a.tail(-1)

      a  b   c
5001  2  7  11
5002  3  8  12
5003  4  9  13
5004  5  0  14

In [20]:
a.tail(-4)

      a  b   c
5004  5  0  14

In [23]:
a.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, 5000 to 5004
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       5 non-null      int64
 1   b       5 non-null      int64
 2   c       5 non-null      int64
dtypes: int64(3)
memory usage: 160.0 bytes

In [24]:
a.tail(-2)

      a  b   c
5002  3  8  12
5003  4  9  13
5004  5  0  14

In [26]:
a.tail(-6)

Empty DataFrame
Columns: [a, b, c]
Index: []

In [31]:
a.info(5005)

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, 5000 to 5004
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       5 non-null      int64
 1   b       5 non-null      int64
 2   c       5 non-null      int64
dtypes: int64(3)
memory usage: 160.0 bytes

In [28]:
a.describe()

              a         b          c
count  5.000000  5.000000   5.000000
mean   3.000000  6.000000  12.000000
std    1.581139  3.535534   1.581139
min    1.000000  0.000000  10.000000
25%    2.000000  6.000000  11.000000
50%    3.000000  7.000000  12.000000
75%    4.000000  8.000000  13.000000
max    5.000000  9.000000  14.000000

In [32]:
type(a)

pandas.core.frame.DataFrame

In [33]:
a['a']

5000    1
5001    2
5002    3
5003    4
5004    5
Name: a, dtype: int64

In [34]:
type(a['a'])

pandas.core.series.Series

In [35]:
type(a['b'])

pandas.core.series.Series

In [37]:
type(a['c'])

pandas.core.series.Series

In [38]:
a[['a']]

      a
5000  1
5001  2
5002  3
5003  4
5004  5

In [39]:
type(a[['a']])

pandas.core.frame.DataFrame

In [40]:
type(a[['b']])

pandas.core.frame.DataFrame

In [41]:
a.loc[5003]

a     4
b     9
c    13
Name: 5003, dtype: int64

In [43]:
a.loc[5003:5005]

      a  b   c
5003  4  9  13
5004  5  0  14

In [46]:
[a.loc[5003:5005]]

[      a  b   c
 5003  4  9  13
 5004  5  0  14]

In [47]:
[[a.loc[5003:5005]]]

[[      a  b   c
  5003  4  9  13
  5004  5  0  14]]

In [48]:
a.loc[5003:5005]['a'],['b']

(5003    4
 5004    5
 Name: a, dtype: int64,
 ['b'])

In [50]:
a.loc[5003:5005][['a','b']]

      a  b
5003  4  9
5004  5  0

In [52]:
a.loc[[],[]]

Empty DataFrame
Columns: []
Index: []

In [54]:
a.loc[[5000,5003],['a','c']]

      a   c
5000  1  10
5003  4  13

In [55]:
a.loc[[5000],['b']]

      b
5000  6

In [59]:
a.loc[5005:5003,['a','c']]

Empty DataFrame
Columns: [a, c]
Index: []

In [62]:
a.loc[5000:5002][['a','b','c']]

      a  b   c
5000  1  6  10
5001  2  7  11
5002  3  8  12

In [67]:
a.loc[0:2,['a','b']]

Empty DataFrame
Columns: [a, b]
Index: []

In [65]:
a.iloc[0:2,[0,2]]

      a   c
5000  1  10
5001  2  11

In [70]:
a['a']>4

5000    False
5001    False
5002    False
5003    False
5004     True
Name: a, dtype: bool

In [71]:
a['a']<5

5000     True
5001     True
5002     True
5003     True
5004    False
Name: a, dtype: bool

In [73]:
a[a['a']>4]

      a  b   c
5004  5  0  14